Repository: tamlyhoctoipham/book-translation-projects
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: vi

source: Sex offenders, especially child abusers, seem to have difficulty in developing and maintaining intimate adult relationships.
vi: Tội phạm tình dục, đặc biệt là những kẻ lạm dụng trẻ em, có vẻ gặp khó khăn trong phát triển và duy trì các mối quan hệ trưởng thành thân mật.

source: Sex offending in the UK includes crimes such as rape (penetration by the penis of someone’s vagina, anus or mouth without consent); assault by penetration (penetration by a body part or object of someone’s vagina or anus without consent); sexual assault (sexual touching); administering a substance with intent to commit a non-consensual sexual act (this covers spiking some- one’s drink); sexual activity with a child (under the age of sixteen), causing or inciting a child to engage in sexual activity; engaging in sexual activity in the presence of a child; meeting a child following sexual grooming (this new offence has been triggered by child abusers using the Internet to meet children); abusing positions of trust (it is unlawful for people who work with children, say in youth services, care homes or schools, to have sex with anyone in their care who is under the age of eighteen).
vi: Quấy rối tình dục ở Vương quốc Anh bao gồm những tội như cưỡng hiếp (dùng dương vật xâm nhập vào âm đạo, hậu môn hoặc miệng của một người khác mà không có sự đồng thuận); cưỡng dâm bằng cách xâm nhập (xâm nhập với phần thân của một vật thể vào âm đạo hoặc hậu môn của một người mà không có sự đồng thuận); tấn công tình dục (đụng chạm thể xác); sử dụng một loại chất với ý đồ thực hiện hành vi tình dục không được đồng thuận (bao gồm cả cho thuốc vào thức uống người khác); hoạt động tình dục với trẻ em (dưới 16 tuổi), sai khiến hoặc xúi giục một đứa trẻ tham gia vào hoạt động tình dục; tham gia vào hoạt động tình dục với sự góp mặt của một đứa trẻ; gặp một đứa trẻ bằng cách thiết lập mối quan hệ thân mật với nó nhằm dụ dỗ, lợi dụng nó (phương thức mới được những kẻ lạm dụng tình dục tạo ra bằng việc sử dụng Internet để gặp trẻ em); lạm dụng nhờ tín nhiệm (việc những người làm việc với trẻ em, như trong các dịch vụ thiếu nhi, chăm sóc ở nhà hoặc trường học có quan hệ tình dục với bất cứ ai thuộc phạm vi chăm sóc của họ mà dưới 18 tuổi đều là phạm pháp).

source: Sex offending is thought of as a very serious problem within contemporary society.
vi: Quấy rối tình dục được biết như là một vấn đề hết sức nghiêm trọng trong xã hội hiện đại.

source: Sexual interests – this is concerned with the preoccupation the offenders have with sex (for example, whether they have a ‘preference’ for rape or sex with children) and offence-related fetishes.
vi: Sở thích tình dục - điều này liên quan đến ám ảnh về tình dục của tội phạm (ví dụ: họ muốn cưỡng hiếp hay quan hệ tình dục với trẻ em) và những tôn sùng liên quan đến lạm dụng.

source: Shame or guilt and their part in punishment is a key element in Judaism, Christianity and Islam, and there is a clear cross-over within Christian-based cultures between what is ‘sinful’ and what is illegal.
vi: Cảm giác nhục nhã hoặc tội lỗi và vai trò của chúng trong việc trừng phạt là yếu tố then chốt trong đạo Do thái, đạo Cơ-đốc và đạo Hồi và có sự giao cắt rõ ràng trong các nền văn hóa có gốc Cơ-đốc giữa cái gì là "tội lỗi" và cái gì là phạm pháp.

source: Shaming is also something that is currently considered as a possible way of making offenders (particularly young offenders) think about their actions and prevent them from offending in future, as well as deterring others.
vi: Thật xấu hổ khi điều đó đang được cân nhắc như một biện pháp khả thi để khiến những tội phạm (đặc biệt là tội phạm trẻ tuổi) suy nghĩ về hành động của họ và ngăn ngừa họ phạm tội trong tương lai, cũng như là răn đe người khác.

source: Sharing a cell with another prisoner means you have little privacy, as can the physical design of the prison.
vi: Ở chung phòng giam với tù nhân khác đồng nghĩa bạn sẽ có ít sự riêng tư hơn, đúng theo mục đích của việc thiết kế của nhà tù

source: She examines battles between the accused and the prosecuting lawyer as revealed in their grammatical usage.
vi: Cô xem xét cuộc chiến giữa bị cáo và luật sư khởi tố vì những tiết lộ trong cách họ sử dụng ngữ pháp.

source: She interviewed lawyers in New Zealand and in England who showed good awareness of the dangers of asking suggestive questions, but who still sometimes chose to use them.
vi: Cô phỏng vấn nhiều luật sư ở New Zealand và Anh, họ nhận thức được nguy hiểm có thể có khi đặt những câu hỏi mang tính gợi ý, nhưng thỉnh thoảng vẫn chọn dùng chúng.

source: She is currently organising an offending behaviour programme for twelve convicted offenders which will address why they committed crimes and what measures can be put in place to prevent further offending on their release from prison.
vi: Hiện tại cô ấy tổ chức chương trình thiết lập hành vi tội phạm cho 12 phạm nhận bị kết án để tìm hiểu tại sao họ lại phạm tội và cái gì là thước đo để tránh những hành động phạm tội khi họ được tại ngoại.

source: She is responsible for assessing offenders to ensure their suitability for the programme and so carries out a number of interviews and assessments with each potential pro- gramme attendee.
vi: Cô ấy chịu tránh nhiệm đánh giá các phạm nhân để chắc chắn rằng hộ phù hợp cho chương trình và sau đó thực hiện một số buổi phỏng vấn và thẩm định với các ứng cử viên phù hợp để tham gia chương trình.

source: She will meet with these on a regular basis in order to monitor their psychological state.
vi: Cô ấy sẽ gặp họ liên tục và thường xuyên để đánh gia mức độ, trạng thái tâm lý của họ.

source: She will read through the statements and reports relating to the case and pick out information relating to the behaviour of the perpretator.
vi: Cô ấy sẽ đọc thật kỹ và tìm lỗi sai từ những lời khai và báo cáo liên quan đến vụ án, sau đó sẽ chắt lọc thông tin về cách cư xử của nghi phạm.

source: Should citizens have the right to protect themself and potentially kill an intruder?
vi: Liệu công dân có được phép bảo vệ bản thân và dẫn đến giết hại người xâm phạm?

source: Should offenders be given the opportunity of rehabilitation?
vi: Phạm nhân có nên có cơ hội được cải tạo?

source: Shuy argued that the prosecution were in a sense caught by their own sting.
vi: Shuy đã tranh cãi rằng bên hành vi này của bên khởi tố là xuất phát từ chính ý thức của họ thông qua chính sự nhập vai của họ.

source: Shuy carried out a close linguistic analysis of the tapes between DeLorean and the DEA’s undercover agent (actually a known con man acting to reduce the charges against him) and argued that DeLorean never agreed to the deal.
vi: Shuy đã tiến hành một cuộc phân tích ngôn ngữ kỹ lưỡng về những đoạn băng ghi âm các cuộc nói chuyện giữa DeLorean và một đặc vụ mật của DEA (thực tế là một kẻ bịp bợm (a con man) quen biết đang giả vờ giúp anh ta giảm án) và thuyết phục mọi người rằng DeLorean chưa bao giờ đồng ý giao dịch này.

source: Shuy’s and others work shows that close linguistic analysis can assist in trials such as DeLorean’s.
vi: Những việc làm của Shuy cũng như của nhiều người khác đã chứng tỏ được rằng một bản phân tích ngôn ngữ kỹ lưỡng cũng có thể đóng góp vào những trường hợp xét xử tương tự như trường hợp của DeLorean.

source: Sidney Cobb has defined social support as the receipt of information from others that one is cared for and valued.
vi: Sidney Cobb đã định nghĩa sự hỗ trợ xã hội giống như hóa đơn từ người khác chứng nhận rằng bạn được quan tâm và có giá trị.

source: Similar figures were found by Jessica Woodhams and Susie Grennan.
vi: Jessica Woodhams và Susie Grennan cũng đã chứng minh ra những số liệu tương tự.

source: Similarity in behaviours related to controlling the victim/witnesses and the distance travelled to commit crimes have performed better as predictors of linkage than variables relating to how the target was selected, the planning of the offence or the property stolen.
vi: Sự tương đồng trong hành vi liên quan đến điều khiển nạn nhân/nhân chứng và khoảng cách đi lại để thực hiện tội ác đã thể hiện tốt hơn trong vai trò dự đoán về sự kết nối các vụ án hơn là các biến số liên quan đến các con mồi bị lựa chọn thế nào, kế hoạch của kẻ thủ ác hay những đồ đạc bị mất cắp.

source: Similarly, a study of female prisoners found that sixteen per cent had considered self- harming, fifteen per cent had considered attempting suicide and six per cent had attempted suicide in the previous month.
vi: Tương tự như thế, nghiên cứu về nữ tù nhân cho thấy 16% trong số họ có hành vi ngược đãi bản thân, 15% cố gắng tự tử và 6% cố gắng tự tử trong tháng vừa qua.

source: Similarly, another study found with a sample of young offenders (aged 16–21) that over fifteen per cent were suffering from severe anxiety, twelve per cent severe depression, and thirty-eight per cent showed clinically high levels of hopelessness.
vi: Tương tự, một nghiên cứu khác cho thấy với một nhóm vị thành niên (16-21) đang phạm tội thì hơn 15% trong số đó có cảm giác căng thẳng cực độ, 12% bị khủng hoảng trầm trọng và 38% theo chẩn đoán lâm sàng có mức độ vọng cao.

source: Similarly, methods that would be unsuccessful in the outside world might work well in the prison environment.
vi: Tương tự như thế, những cách được cho là không thể áp dụng cho cuộc sống thường ngày lại có thể mang lại kết quả tốt trong môi trường tù ngục.

source: Similarly, someone who has a long history of offending or has been convicted of a serious offence (such as a violent or sexual offence) may have different treatment needs from someone who has been caught committing an offence for the very first time.
vi: Tương tự, một người có tiền án hoặc đã bị kết án vì một tội ác nghiêm trọng (như tội ác liên quan đến bạo lực hoặc tình dục) có thể sẽ được hưởng chế độ điều trị khác với người mà bị bắt vì phạm tội lần đầu.

source: Similarly, the US Department of Justice found seventy- nine per cent of women prisoners were mothers and frequently they were single parents.
vi: Tương tự theo đó, sở Tư pháp của Mỹ tìm ra rằng 79% nữ tù nhân đã làm mẹ, và thông thường là người mẹ đơn thân.

source: Similarly, while case linkage has also received research attention it is a developing field and one that perhaps does not lend itself as well to exciting dramatization: hence its absence from popular media.
vi: Tương tự như vậy, trong khi kết nối vụ án cũng nhận được nhiều sự chú ý từ giới nghiên cứu, nó cũng là một lĩnh vực đang phát triển và có thể không quá hướng đến việc tạo ra sự kịch tính, vậy nên thường vắng bóng trên các phương tiện truyền thông.

source: Since 2004 the MAPPPs must also have two lay people on the panels; these are people from the community in which the offender lives.
vi: Kể từ năm 2004, Những sắp xếp bảo vệ công chúng đa chi nhánh cũng phải có 2 người đặt ở...., đây là những người từ cộng đồng có những kẻ phạm tội sinh sống.

source: Since prisoner bullying has been associated with failed rehabilitation and recidivism, self-injury by prisoners and poor psycho- logical health, a good understanding of why it occurs is needed if criminal psychologists are going to help reduce bullying in prison.
vi: Chính vì sự bắt nạt tù nhân thường đi kèm với việc không thể phục hồi sau chấn thương hoặc tái phạm một hành vi nào đó, tự hành hạ bản thân bởi chính những tù thân hoặc thể trạng yếu, cần có một nghiên cứu sâu để lí giải cho nguyên nhân tại sao việc đó xảy ra để các nhà tâm lí học có thể áp dụng và giảm thiểu việc khủng bố trong

source: Since the Sexual Offences Act 2003, which came into force in May 2004, the requirements of registration have been tightened.
vi: Từ khi Luật vi phạm tình dục năm 2003 được đưa vào thực thi tháng Năm năm 2014, những yêu cầu của việc đăng ký đã được thắt chặt.

source: Since the early 1990s, when offenders are sentenced to a prison stay or a community penalty in the UK they are also assessed for whether they are suitable to take part in a Sex Offender Treatment Programme (SOTP).
vi: Từ những năm đầu của thập niên 90, ở Vương quốc Anh, khi tội phạm đã bị kết án phải ngồi tù hoặc chịu hình phạt của cộng đồng, họ cũng phải được thông qua đánh giá liệu họ có phù hợp để tham gia vào Chương trình Điều trị cho Tội phạm tình dục (SOTP) hay không.

source: Since these criminogenic needs are dynamic or theoretically changeable, treatment that focuses on the resolution of these problems is more likely to be associated with a reduction in recidivism.
vi: Từ khi lý thuyết về các nhu cầu dẫn đến phạm tội thay đổi về đã tạo động lực cho việc điều trị - chúng dần tập trung vào việc kiên quyết làm sáng tỏ các vấn đề có thể gắn liền với việc giảm bớt xu hướng tái phạm tội.

source: Skills orientated: The programme should teach the offenders skills which will help them live and work a crime free life.
vi: Định hướng kĩ năng: Chương trình nên dạy cho phạm nhân các kĩ năn nhằm giúp đỡ họ sống và làm việc mà không phạm tội.

source: Skillstreaming is the behavioural part of the programme.
vi: Skillstreaming là phần nội dung liên quan đến các yếu tố hành vi của chương trình.

source: Smoking can be conceptualized as problem behaviour in much the same way as criminal behaviour can.
vi: Có thể nhận thấy rằng, hút thuốc lá được ví như vấn đề về cách cư xử và nó cũng khá giống với hành vi phạm tội.

source: So far the government have been so pleased with the work of PCSOs that it plans to increase the numbers from 6,214 currently to at least 25,000 by 2008.
vi: Cho đến hiện tại thì chính phủ vẫn khá hài lòng với sự hoạt động của PCSOs và đang được lên kế hoạch để gia tăng số lượng từ 6,214 gần đây lên tối thiểu 25,000 vào năm 2008.

source: So far two sorts of linguistic evidence have been discussed, evidence of linguistic competence – Could the speaker understand or communicate sufficiently for the judicial process?
vi: Cho đến giờ, chỉ có hai dạng bằng chứng ngôn ngữ học được đem ra thảo luận là bằng chứng về năng lực ngôn ngữ - tức liệu người nói có thể hiểu và giao tiếp trong một chừng mực thích hợp khi tham gia quá trình tố tụng hay không ?

source: So how might professionals become better lie detectors?
vi: Vậy làm thế nào để các chuyên gia nhận biết nói dối tốt hơn?

source: So it is important to think about what it is that separates sex offenders from people who are sometimes termed ‘general offenders’.
vi: Vì vậy, điều quan trọng là cái gì phân biệt giữa tội phạm tình dục và những người bị cho là "tội phạm chung chung".

source: So long as the alternatives (e.g. the various types of gun) are sufficiently similar to each other so that the ‘correct’ one does not stand out to an innocent suspect and the media or the police have not let slip (to the innocent suspect) what the ‘correct’ alternative is, then the GKT may not suffer as a procedure from as many problems at the CQT.
vi: Với điều kiện là các lựa chọn (ví dụ như các loại súng khác nhau) phải gần như tương đồng để đáp án 'chính xác' không quá nổi bật đối với nghi phạm vô tội và truyền thông hay cảnh sát không tiết lộ (cho nghi phạm) đâu là lựa chọn 'chính xác', thì phương pháp GKT có thể không gặp phải các trở ngại như phương pháp CQT.

source: So what are suitable characteristics for police officers?
vi: Vậy những phẩm chất phù hợp với cảnh sát là gì?

source: So what are the explanations that criminal psychologists have offered to explain false confessions?
vi: Thế thì các nhà tâm lý học tội phạm đưa ra lý giải thế nào về những lời thú nhận giả?

source: So what do those people actually do?
vi: Vậy thật sự những người đó đang làm gì?

source: So what does research tell us about how people usually behave when lying?
vi: Vì vậy nghiên cứu đã cho chúng ta biết gì về hành vi của con người khi nói dối?

source: So why are many professionals such as police officers far from perfect at detecting deception?
vi: Vậy tại sao nhiều chuyên gia như cảnh sát lại không làm tốt trong việc phát hiện nói dối?

source: So, a mugger is not likely to be executed, and a murderer is not likely be sentenced to a community penalty.
vi: Vì thế nên 1 tên trộm cướp thì không thể bị xử tử và 1 tên sát nhân thì không thể chỉ bị phạt lao động công ích.

source: So, if someone killed a man, the murderer had to pay 100 shillings to the victim’s family.
vi: Vì thế, nếu giết hại 1 người, tên sát nhân phải trả 100 shillings cho gia đình nạn nhân.

source: So, when considering the numbers of people affected by imprisonment, how many are we actually talking about?
vi: Vậy khi xem xét số lượng tù nhân đã bị sang chấn tâm lý, con số đó thực chất là bao nhiêu?

source: Social loneliness may result from rumour-spreading or ostracism if the peer group withdraws from the victim.
vi: Cảm giác cô đơn, lạc lõng trong tập thể có thể là kết quả từ sự lan truyền các lời đồn đại hoặc bị tẩy chay nếu những thành viên trong nhóm dừng giao tiếp với nạn nhân .

source: Social loneliness, on the other hand, is where you are not part of an engaging social network.
vi: Mặt khác, đơn độc xã hội xảy ra khi bạn không còn là một phần viên tham gia vào mạng lưới xã hội.

source: Social support can come from different sources including family, friends and intimate partners.
vi: Hỗ trợ xã hội có thể đến từ gia đình, bạn bè hay những người bạn tù.

source: Societies expect that their police service will protect them from wrongdoers, especially dangerous criminals, and police forces strive hard to achieve this.
vi: Người dân trong xã hội luôn mong chờ ngành cảnh sát sẽ bảo vệ họ khỏi những người phạm pháp, đặc biệt là những tên tội phạm đặc biệt nguy hiểm, và lực lượng cảnh sát luôn cố gắng hết mình để hoàn thành nghĩa vụ ấy.

source: Society and policing have changed, and the image of policing image reflects this.
vi: Xã hội và ngành cảnh sát đã thay đổi, và hình ảnh của bức tranh ngành cảnh sát phản ánh điều này.

source: Socio-affective functioning – this looks at how offenders fill emotional needs.
vi: Chức năng tiếp nhận ảnh hưởng của xã hội - điều này nói về cách mà các tội phạm lấp đầy nhu cầu cảm xúc.

source: Solan and other researchers show how these different constructions affect the jury’s decision- making and can lead either to higher or lower conviction rates.
vi: Solan và các nhà nghiên cứu khác cho thấy làm thế nào các cách đặt câu khác nhau ảnh hưởng đến việc ra quyết định của ban giám khảo và có thể dẫn đến hoặc là tỷ lệ kết án cao hơn hoặc thấp hơn.

source: Some countries are believed to employ polygraph testing to help determine who within, or wishing to join, their security services is a threat (e.g. a spy or a terrorist).
vi: Một vài quốc gia tin rằng việc áp dụng kiểm tra với máy phát hiện nói dối có thể giúp họ xác định người nào đang hoặc mong muốn tham gia vào lực lượng quân sự là một mối nguy (một tên gián điệp hoặc khủng bố).

source: Some countries have also taken steps designed to improve the interviewing of witnesses, especially (i) those who may have been victims of serious crimes such as sexual abuse and (ii) those who need most help to remember accurately (e.g. children and vulnerable adults).
vi: Một số quốc gia đã bắt đầu từng bước hoàn thiện quy trình thẩm vấn nhân chứng của họ, đặc biệt là với những người có thể từng là nạn nhân của các vụ án nghiêm trọng như quấy rối tình dục và (ii) những người cần nhiều sự giúp đỡ mới có thể nhớ lại chính xác thông tin (như trẻ em và người lớn yếu thế).

source: Some do admit to it.
vi: Một vài người thừa nhận đã làm.

source: Some empirical evaluations of offender profiling have been conducted and these will be briefly mentioned here.
vi: Một số thẩm định về lập hồ sơ tội phạm dựa trên quan sát và kinh nghiệm thực tế đã được thực hiện và sẽ được nhắc đến ngắn gọn dưới đây.

source: Some examples of these are the impact of interviewing techniques on a suspect or witness, the reliability of eyewitness testimony, the clinical assessment of a suspect or witness, or the use of profiling techniques during an investigation.
vi: Một số ví dụ về sự việc trên là sự ảnh hưởng của kỹ thuật phỏng vấn nghi phạm hay nhân chứng, mức độ tin cậy trong lời khai của nhân chứng, đánh giá về lịch sử bệnh lý của nghi phạm và nhân chứng, hay việc định dạng các kỹ thuật trong khi điều tra.

source: Some have been adapted from personality psychology, others relate directly to this particular criminal psychology practice.
vi: Một số giả định được phỏng theo tâm lý học tính cách, những giả định khác có liên quan trực tiếp tới hoạt động tâm lý học tội phạm đặc thù này.

source: Some have considered psychological health under the umbrella term of adjustment to prison whereas others have used questionnaire-based measures such as the General Health Questionnaire.
vi: Một vài người xem xét sức khoẻ tâm dưới cái nhìn ô hạn của việc điều chỉnh khi ở trong tù, trong khi nhũng người khác sử dụng những phương pháp dựa trên các câu hỏi ví dụ như Bảng câu hỏi về sức khoẻ tổng quát .

source: Some have focused on the criminal setting and have been based on experienced investigators’ beliefs about such cues.
vi: Một số tập trung vào hệ thống sắp đặt tội phạm và dựa vào niềm tin của những điều tra viên kinh nghiệm về những dấu hiệu ấy

source: Some indicated that the profiler’s advice was ignored because it did not match their own opinions.
vi: Một vài người còn ám chỉ rằng lời khuyên từ người lập hồ sơ bị lờ đi bởi vì chúng không khớp với ý kiến của riêng họ.

source: Some methods used by prisoners to cope with imprisonment have been alluded to above.
vi: Các tù nhân đã dùng một số phương pháp đã đề cập ở trên để đối phó với việc bị tống giam.

source: Some newspaper reports would suggest not.
vi: Một vài bài báo nêu ý kiến rằng đó là điều không cần thiết.

source: Some of the developmental experiences mentioned above are often typical of many types of offenders, not just sex offenders.
vi: Một số kinh nghiệm thực tiễn đã được đề cập ở trên thường làm về nhiều dạng tội phạm điển hình chứ không chỉ nói về tội phạm tình dục.

source: Some of the factors that have been reported to be associated with suicide in prison include:
vi: Một vài yếu tố đã được cho là có liên quan đến việc gây tự tử trong tù bao gồm:

source: Some of the kinds of psychological research that informed these guidelines will be described in this chapter.
vi: Một số nghiên cứu tâm lý trong cuốn hướng dẫn đó sẽ được nêu ra trong chương này.

source: Some of the participants were told which cues actually discriminated and some were not.
vi: Một vài người tham gia được biết những dấu hiệu nào thực sự khác biệt và một vài người khác thì không.

source: Some of the topics of interest to forensic linguists overlap with or have parallels with forensic psychology.
vi: Một số trong những chủ đề quan tâm đến ngôn ngữ học pháp y trùng với hoặc có sự tương đồng với tâm lý học pháp y.

source: Some of these coping strategies we might perceive as adaptive whereas others appear more maladaptive.
vi: Những cách đối phó trên đối với một vài người là sự thích nghi nhưng với người khác là sự ngược lại.

source: Some of these may not do so even in the face of ethically and morally questionable procedures involving torture and threats to their families.
vi: Một vài người trong số họ có thể sẽ không làm như vậy, ngay cả khi phải đối mặt với đạo đức, luân lý xã hội hay các biện pháp tra tấn, trừng phạt và các mối đe dọa với gia đình.

source: Some of these relate to the outside world whereas others relate to the internal world of the prison.
vi: Một số tác nhân xuất phát từ yếu tố bên ngoài trong khi một số khác lại bắt nguồn từ môi trường bên trong nhà tù
